Revit 2026 API

# RailingSetMultistoryStairsPlacementLevels Method

---
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetMultistoryStairsPlacementLevels(
	ISet<ElementId> levelIds
)
```
```vb
Public Sub SetMultistoryStairsPlacementLevels (
	levelIds As ISet(Of ElementId)
)
```
```cpp
public:
void SetMultistoryStairsPlacementLevels(
	ISet<ElementId^>^ levelIds
)
```
```fsharp
member SetMultistoryStairsPlacementLevels :
        levelIds : ISet<ElementId> -> unit
```

#### Parameters

levelIds ISetElementId

#### Reference

Railing Class

Autodesk.Revit.DB.Architecture Namespace